spec/fixtures/services/ad_param_service/mutate_set-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/cm/v200909/AdParamService' -->
<?xml version='1.0' encoding='UTF-8'?> 
<env:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:env='http://schemas.xmlsoap.org/soap/envelope/' xmlns='https://adwords.google.com/api/adwords/cm/v200909' xmlns:s='https://adwords.google.com/api/adwords/cm/v200909'>
  <env:Header>
    <s:RequestHeader env:mustUnderstand='0'>
      <authToken>
        ***censured***
      </authToken>
      <userAgent>
        Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)
      </userAgent>
      <developerToken>
        ***censured***
      </developerToken>
      <clientEmail>
        client_2+sem4ruby@gmail.com
      </clientEmail>
    </s:RequestHeader>
  </env:Header>
  <env:Body>
    <mutate xmlns='https://adwords.google.com/api/adwords/cm/v200909'>
      <operations xsi:type='AdParamOperation'>
        <operator>
          SET
        </operator>
        <operand>
          <adGroupId>
            3060219043
          </adGroupId>
          <criterionId>
            11536082
          </criterionId>
          <paramIndex>
            1
          </paramIndex>
          <insertionText>
            $99.99
          </insertionText>
        </operand>
      </operations>
    </mutate>
  </env:Body>
</env:Envelope>
